#include<stdio.h>
int main(){
	char str[10];
	while(scanf("%s",str)!=-1){
		if((str[3]=="又"[0]&&str[4]=="又"[1]&&str[5]=="又"[2])||(str[3]=="有"[0]&&str[4]=="有"[1]&&str[5]=="有"[2])){
			int a=0,b=0;
			if(str[0]=="一"[0]&&str[1]=="一"[1]&&str[2]=="一"[2]){
				a=1;
			}
			else if(str[0]=="二"[0]&&str[1]=="二"[1]&&str[2]=="二"[2]){
				a=2;
			}
			else if(str[0]=="三"[0]&&str[1]=="三"[1]&&str[2]=="三"[2]){
				a=3;
			}
			else if(str[0]=="四"[0]&&str[1]=="四"[1]&&str[2]=="四"[2]){
				a=4;
			}
			else if(str[0]=="五"[0]&&str[1]=="五"[1]&&str[2]=="五"[2]){
				a=5;
			}
			else if(str[0]=="六"[0]&&str[1]=="六"[1]&&str[2]=="六"[2]){
				a=6;
			}
			else if(str[0]=="七"[0]&&str[1]=="七"[1]&&str[2]=="七"[2]){
				a=7;
			}
			else if(str[0]=="八"[0]&&str[1]=="八"[1]&&str[2]=="八"[2]){
				a=8;
			}
			else if(str[0]=="九"[0]&&str[1]=="九"[1]&&str[2]=="九"[2]){
				a=9;
			}
			else if(str[0]=="十"[0]&&str[1]=="十"[1]&&str[2]=="十"[2]){
				a=10;
			}
//-------------------------------------------------------------------------
			if(str[6]=="一"[0]&&str[7]=="一"[1]&&str[8]=="一"[2]){
				b=1;
			}
			else if(str[6]=="二"[0]&&str[7]=="二"[1]&&str[8]=="二"[2]){
				b=2;
			}
			else if(str[6]=="三"[0]&&str[7]=="三"[1]&&str[8]=="三"[2]){
				b=3;
			}
			else if(str[6]=="四"[0]&&str[7]=="四"[1]&&str[8]=="四"[2]){
				b=4;
			}
			else if(str[6]=="五"[0]&&str[7]=="五"[1]&&str[8]=="五"[2]){
				b=5;
			}
			else if(str[6]=="六"[0]&&str[7]=="六"[1]&&str[8]=="六"[2]){
				b=6;
			}
			else if(str[6]=="七"[0]&&str[7]=="七"[1]&&str[8]=="七"[2]){
				b=7;
			}
			else if(str[6]=="八"[0]&&str[7]=="八"[1]&&str[8]=="八"[2]){
				b=8;
			}
			else if(str[6]=="九"[0]&&str[7]=="九"[1]&&str[8]=="九"[2]){
				b=9;
			}
			else if(str[6]=="十"[0]&&str[7]=="十"[1]&&str[8]=="十"[2]){
				b=10;
			}
			a=a+b;
			if(a>=10){
				b=a/10; 
				if(b==1){
					printf("十");
				}
				else{
					printf("二十");
				}
				a=a-10;
			}
			if(a==1){
				printf("一");
			}
			if(a==2){
				printf("二");
			}
			if(a==3){
				printf("三");
			}
			if(a==4){
				printf("四");
			}
			if(a==5){
				printf("五");
			}
			if(a==6){
				printf("六");
			}
			if(a==7){
				printf("七");
			}
			if(a==8){
				printf("八");
			}
			if(a==9){
				printf("九");
			}
			printf("\n");		
		}
		else{
			printf("謬\n");
		}
	}
	
	return 0;
}
